# data kilder
Data for danmark: https://www.statbank.dk/20050 

Data for Norge: https://www.ssb.no/en/statbank/table/03672/tableViewLayout1/

In [ ]:
import pandas as pd
import numpy as np
from scipy import stats
import statsmodels.api as sm

In [ ]:
# Norway data
df = pd.read_excel('data_raw/roykere_no_72_24.xlsx')
df.head(15)

,"05307: Dagligrøykere og av-og-til-røykere (16-79 år), etter kjønn, alder, år og statistikkvariabel",Unnamed: 1,Unnamed: 2,Unnamed: 3
0,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Andel dagligrøykere (prosent)
2,Begge kjønn,I alt,1973.0,42
3,NaN,NaN,1974.0,41
4,NaN,NaN,1975.0,41
5,NaN,NaN,1976.0,39
6,NaN,NaN,1977.0,38
7,NaN,NaN,1978.0,38
8,NaN,NaN,1979.0,37
9,NaN,NaN,1980.0,36
10,NaN,NaN,1981.0,36
11,NaN,NaN,1982.0,36
12,NaN,NaN,1983.0,37
13,NaN,NaN,1984.0,37
14,NaN,NaN,1985.0,37

In [15]:
df_cleaned = df.drop(df.columns[[0, 1]], axis=1)
df_cleaned = df_cleaned.drop(df_cleaned.index[0:2])
df_cleaned.head(30)

    Unnamed: 2 Unnamed: 3
2       1973.0         42
3       1974.0         41
4       1975.0         41
5       1976.0         39
6       1977.0         38
7       1978.0         38
8       1979.0         37
9       1980.0         36
10      1981.0         36
11      1982.0         36
12      1983.0         37
13      1984.0         37
14      1985.0         37
15      1986.0         36
16      1987.0         37
17      1988.0         37
18      1989.0         36
19      1990.0         35
20      1991.0         35
21      1992.0         34
22      1993.0         36
23      1994.0         33
24      1995.0         33
25      1996.0         33
26      1997.0         34
27      1998.0         33
28      1999.0         31
29      2000.0         31
30      2001.0         29
31      2002.0         29

In [ ]:
df_eng = pd.read_excel('data_raw/roykere_eng_00_23.xlsx')
df_eng.head(15)

    Unnamed: 0 Unnamed: 1    Unnamed: 2
0          NaN       year  All above 16
1          NaN       2023          10.5
2          NaN       2022            11
3          NaN       2021          12.6
4          NaN       2020          14.4
5          NaN       2019          15.5
6          NaN       2018          16.3
7          NaN       2017          16.4
8          NaN       2016          15.8
9          NaN       2015          17.9
10         NaN       2014          18.5
11         NaN       2013          18.6
12         NaN       2012          19.9
13         NaN       2011          19.1
14         NaN       2010          19.6

In [19]:
df_eng_cleaned = df_eng.drop(df_eng.columns[[0]], axis=1)
df_eng_cleaned.head(30)

   Unnamed: 1    Unnamed: 2
0        year  All above 16
1        2023          10.5
2        2022            11
3        2021          12.6
4        2020          14.4
5        2019          15.5
6        2018          16.3
7        2017          16.4
8        2016          15.8
9        2015          17.9
10       2014          18.5
11       2013          18.6
12       2012          19.9
13       2011          19.1
14       2010          19.6
15       2009          20.6
16       2008          20.8
17       2007          20.5
18       2006          21.8
19       2005          23.7
20       2004          24.7
21       2003          25.4
22       2002          25.5
23       2001          26.5
24       2000          26.8

In [20]:
df_cleaned.to_excel('data_washed/norway_smokers.xlsx')
df_eng_cleaned.to_excel('data_washed/england_smokers.xlsx')